Revit 2021.1 API
LightingFixture Properties
The LightingFixture type exposes the following members.
Properties
Name | Description
AssignedElectricalSystems |  Obsolete.
Retrieves the electrical systems this electrical panel currently is assigned to.
 (Inherited from MEPModel.)
ConnectorManager
 Retrieves the Connector Manager from this MEPModel.
 (Inherited from MEPModel.)
ElectricalSystems |  Obsolete.
Retrieves the electrical systems that are currently created using this MEPModel.
 (Inherited from MEPModel.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from MEPModel.)
See Also
LightingFixture Class
Autodesk.Revit.DB.Electrical Namespace